README.org
#+TITLE: Melodia Bot
#+AUTHOR: Evan
#+DATE: <2025-02-13>
#+OPTIONS: toc:2

* Overview
This is a simple Discord music bot built utilizing Python, Docker, and yt-dlp. I made this bot to self host it on my Unraid server, but you can host it without Unraid as well as long as you have Docker.

* Installation

** Docker Install
1. Pull the Docker image:
   #+BEGIN_SRC sh
   docker pull sticio/discord-music-bot
   #+END_SRC

2. Run the bot with your token:
   #+BEGIN_SRC sh
   docker run -e DISCORD_BOT_TOKEN="your-token-here" sticio/discord-music-bot
   #+END_SRC

** Installation On Unraid
1. Open the **Unraid Web UI**.
2. Go to the **Docker** tab and click **Add Container**.
3. Set the **Repository** to: sticio/discord-music-bot
4. Under **Environment Variables**, add:
- **Key**: `DISCORD_BOT_TOKEN`
- **Value**: `your-bot-token-here`
5. Click **Apply** and start the container.


* Commands
| Command  | Description |
|----------|------------|
| !play [song] | Plays a song from YouTube |
| !skip | Skips the current song |
| !queue | Shows the song queue |
| !loop | Toggles looping |
| !join | Joins voice channel     |
| !leave | Disconnects from the voice channel |
